Revit 2027 API
FilteredElementIterator.Current Property
Gets the item at the current position of the iterator.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual Element Current { get; }
Public Overridable ReadOnly Property Current As Element
	Get
public:
virtual property Element^ Current {
	Element^ get ();
}
abstract Current : Element with get
override Current : Element with get
Property Value
Element
Implements
IEnumerator<T>.Current
Exceptions
Exception | Condition
InvalidOperationException |  There is no current item in the iterator.
Remarks
There is no current item if the iterator has not started yet or has been done.
See Also
Reference
FilteredElementIterator Class
Autodesk.Revit.DB Namespace